content/idea/do_you_like_games.md
+++
title = "Do you like games?"
description = "Thoughts about a micro ARG running on a raspberry pi"
date = 2016-02-10T18:31:28Z
tags = ["games", "toys"]
+++

A mini, puzzle orientated game hosted on a raspberry pi or similar
small device.

It could act as an open wifi access point, maybe running some sort of
captive portal?

Make it text based, with a green screen terminal interface - accessing
any website would redirect you to the opening page of the game - green
screen themed. Hinting at retro nature and hopefully pointing people
towards possibilities like Telnet/Gopher etc.

Possible Themes:

-   Murder mystery
-   Educational
-   Retro Futuristic
    -   Early internet protocols (Gopher, etc) but evolved to modern usage
-   Time travel - sent form the future but misjudged current technology?
-   ???

It could have a twitter (or other social network) feed:

-   Progress updates (e.g. "gilesp has joined the game", "johnsmith has
    discovered a clue")
-   (Alternatively?) the home screen could display a status feed

Part of the game could be a gopher server running on the host

-   Clues to gopher presence:
    -   A reference to the gopher RFC could act as an early clue
    -   The host/port could be enciphered somehow
    -   (partial) Code for gopher client on a page on captive portal
        -   Also discussion of (modern) gopher clients
-   Gopher server could contain content for story section and/or clues
    to next section

Puzzles

-   Baudot - telegraph code?

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">H</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">E</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\*</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">L</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">L</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
<td class="org-left">\*</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Left</td>
<td class="org-left">Hand</td>
<td class="org-left">Right</td>
<td class="org-left">Hand</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
